app/views/tasks/_form.html.erb

SELECT "labels".* FROM "labels"
SELECT "labels".* FROM "labels" INNER JOIN "labellings" ON "labels"."id" = "labellings"."label_id" WHERE "labellings"."task_id" = $1 AND "labels"."id" = $2 LIMIT $3  [["task_id", 11], ["id", 1], ["LIMIT", 1]]
---
  <div class="field">
    <% Label.all.each do |label| %>
    <%= form.check_box :label_ids, { multiple: true, checked: @task.labels.find_by(id: label.id).present?, include_hidden: false }, label[:id] %>